# -*- coding:UTF-8 -*-

"""
说明：考试工程文件
      使用方法请阅读“python考试工程补充说明”
"""

S000 = u"S000:初始化成功"             
S001 = u"S001:预订成功"               
S002 = u"S002:退房成功"                   
S003 = u"S003:没有任何记录"
S004 = u"当前营业额为:%s"                       
     
E000 = u"E000:非法命令"    
E001 = u"E001:参数错误"                 
E002 = u"E002:房间数量不够"                   
E003 = u"E003:没有该用户的订房信息"                 
E004 = u"E004:退房时间超出用户预订时间范围" 
E005 = u"E005:该用户所有房间已退" 

SINGLE=1
DOUBLE=2
SUIT=3

EMPTY=0
USED=1

INVALID_UID=0
